thunle/CameraWebServer_ESP32S3_OV3660/.arduino-build-sensor-test/sketch/app_httpd.cpp
#line 1 "C:\\Users\\Julius\\Documents\\Arduino\\CameraWebServer_ESP32S3_OV3660\\app_httpd.cpp"
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
#include "Arduino.h"
#include "board_config.h"
#include "camera_index.h"
#include "esp32-hal-ledc.h"
#include "esp_camera.h"
#include "esp_heap_caps.h"
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_wifi.h"
#include "fb_gfx.h"
#include "img_converters.h"
#include "sdkconfig.h"
#include <WiFi.h>
#include <Preferences.h>

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// LED FLASH setup
#if defined(LED_GPIO_NUM)
#define CONFIG_LED_MAX_INTENSITY 255
int led_duty = 0;
bool isStreaming = false;
#endif

// Buzzer setup
#ifndef BUZZER_PIN
#define BUZZER_PIN 2 // Default Pin for Buzzer - can be changed
#endif

typedef struct {
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE =
    "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART =
    "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: "
    "%d.%06d\r\nX-RSSI: %d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;
static volatile bool streamClientActive = false;

static void set_close_headers(httpd_req_t *req) {
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "Connection", "close");
}

extern volatile uint32_t wifiDisconnectCount;
extern volatile uint32_t wifiGotIpCount;
extern volatile uint32_t buzzerPulseUntilMs;
extern volatile bool buzzerAlarmEnabled;
extern volatile bool localRadarBuzzerEnabled;
extern Preferences settingsPrefs;
extern volatile uint32_t sensorLastReadMs;
extern volatile uint32_t radarLastMotionMs;
extern volatile uint32_t radarMotionCount;
extern volatile uint32_t darkAlarmCount;
extern volatile uint32_t localRadarBuzzerCount;
extern volatile uint32_t radarUartByteCount;
extern volatile uint32_t radarUartLastRxMs;
extern volatile uint32_t radarUartFrameCount;
extern volatile uint32_t radarUartCurrentBaud;
extern volatile uint32_t radarEnergyFrameCount;
extern volatile int radarUartRange;
extern volatile uint16_t radarEnergyDistanceCm;
extern volatile int lightRaw;
extern volatile bool radarActive;
extern volatile bool daylightActive;
extern volatile bool radarUartPresent;
extern volatile bool radarEnergyPresent;
extern void remoteLogf(const char *format, ...);
extern void remoteLogln(const char *message);
extern String getRemoteLogSnapshot(bool clearAfterRead);
extern String getRadarUartLastHexSnapshot();
extern String getRadarUartLastTextSnapshot();
extern void getRadarGateEnergySnapshot(uint16_t *out, size_t count);

typedef struct {
  size_t size;
  size_t index;
  size_t count;
  int sum;
  int *values;
} ra_filter_t;

static ra_filter_t ra_filter;

static ra_filter_t *ra_filter_init(ra_filter_t *filter, size_t sample_size) {
  memset(filter, 0, sizeof(ra_filter_t));
  filter->values = (int *)malloc(sample_size * sizeof(int));
  if (!filter->values)
    return NULL;
  memset(filter->values, 0, sample_size * sizeof(int));
  filter->size = sample_size;
  return filter;
}

// FPS Filter: Jetzt immer aktiv, unabhängig vom Log-Level
static int ra_filter_run(ra_filter_t *filter, int value) {
  if (!filter->values)
    return value;
  filter->sum -= filter->values[filter->index];
  filter->values[filter->index] = value;
  filter->sum += filter->values[filter->index];
  filter->index++;
  filter->index = filter->index % filter->size;
  if (filter->count < filter->size)
    filter->count++;
  return filter->sum / filter->count;
}

#if defined(LED_GPIO_NUM)
void enable_led(bool en) {
  int duty = en ? led_duty : 0;
  if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY))
    duty = CONFIG_LED_MAX_INTENSITY;
  ledcWrite(LED_GPIO_NUM, duty);
}
#endif

// BMP Handler
static esp_err_t bmp_handler(httpd_req_t *req) {
  camera_fb_t *fb = esp_camera_fb_get();
  if (!fb) {
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }
  httpd_resp_set_type(req, "image/x-windows-bmp");
  httpd_resp_set_hdr(req, "Content-Disposition",
                     "inline; filename=capture.bmp");
  set_close_headers(req);

  uint8_t *buf = NULL;
  size_t buf_len = 0;
  bool converted = frame2bmp(fb, &buf, &buf_len);
  esp_camera_fb_return(fb);
  if (!converted)
    return ESP_FAIL;
  esp_err_t res = httpd_resp_send(req, (const char *)buf, buf_len);
  free(buf);
  return res;
}

static size_t jpg_encode_stream(void *arg, size_t index, const void *data,
                                size_t len) {
  jpg_chunking_t *j = (jpg_chunking_t *)arg;
  if (!index)
    j->len = 0;
  if (httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK)
    return 0;
  j->len += len;
  return len;
}

// Capture Handler (Einzelbild)
static esp_err_t capture_handler(httpd_req_t *req) {
  camera_fb_t *fb = NULL;
#if defined(LED_GPIO_NUM)
  enable_led(true);
  vTaskDelay(150 / portTICK_PERIOD_MS);
  fb = esp_camera_fb_get();
  enable_led(false);
#else
  fb = esp_camera_fb_get();
#endif
  if (!fb) {
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }
  httpd_resp_set_type(req, "image/jpeg");
  set_close_headers(req);

  esp_err_t res = ESP_OK;
  if (fb->format == PIXFORMAT_JPEG) {
    res = httpd_resp_send(req, (const char *)fb->buf, fb->len);
  } else {
    jpg_chunking_t jchunk = {req, 0};
    res = frame2jpg_cb(fb, 80, jpg_encode_stream, &jchunk) ? ESP_OK : ESP_FAIL;
    httpd_resp_send_chunk(req, NULL, 0);
  }
  esp_camera_fb_return(fb);
  return res;
}

// DER OPTIMIERTE STREAM HANDLER
static esp_err_t stream_handler(httpd_req_t *req) {
  if (streamClientActive) {
    httpd_resp_set_status(req, "503 Busy");
    httpd_resp_set_type(req, "text/plain");
    set_close_headers(req);
    return httpd_resp_sendstr(req, "stream already active");
  }
  streamClientActive = true;

  camera_fb_t *fb = NULL;
  struct timeval _timestamp;
  esp_err_t res = ESP_OK;
  size_t _jpg_buf_len = 0;
  uint8_t *_jpg_buf = NULL;
  // char *part_buf[128]; // Moved to inner scope with larger size
  static int64_t last_frame = 0;
  static int64_t last_log = 0;
  static uint32_t fb_fail_count = 0;
  static uint32_t send_fail_count = 0;
  int current_rssi = 0; // Declare here to use in both stream and serial

