thunle/CameraWebServer_ESP32S3_OV3660/.arduino-build-sensor-test/sketch/app_httpd.cpp
  if (!last_frame)
    last_frame = esp_timer_get_time();

  res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
  if (res != ESP_OK) {
    streamClientActive = false;
    return res;
  }

  set_close_headers(req);

#if defined(LED_GPIO_NUM)
  isStreaming = true;
#endif

  while (true) {
    uint32_t fb_get_ms = 0;
    uint32_t send_ms = 0;
    bool send_attempted = false;
    int64_t fb_start = esp_timer_get_time();
    _jpg_buf_len = 0;

    // Fetch RSSI at start of loop
    wifi_ap_record_t wifi_info;
    if (esp_wifi_sta_get_ap_info(&wifi_info) == ESP_OK) {
      current_rssi = (int)wifi_info.rssi; // Cast int8_t to int properly
    }

    fb = esp_camera_fb_get();
    fb_get_ms = (uint32_t)((esp_timer_get_time() - fb_start) / 1000);
    if (!fb) {
      fb_fail_count++;
      res = ESP_FAIL;
    } else {
      _timestamp.tv_sec = fb->timestamp.tv_sec;
      _timestamp.tv_usec = fb->timestamp.tv_usec;
      if (fb->format != PIXFORMAT_JPEG) {
        bool jpeg_converted = frame2jpg(fb, 80, &_jpg_buf, &_jpg_buf_len);
        esp_camera_fb_return(fb);
        fb = NULL;
        if (!jpeg_converted)
          res = ESP_FAIL;
      } else {
        _jpg_buf_len = fb->len;
        _jpg_buf = fb->buf;
      }
    }

    int64_t send_start = esp_timer_get_time();
    if (res == ESP_OK) {
      send_attempted = true;
      res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY,
                                  strlen(_STREAM_BOUNDARY));
    }
    if (res == ESP_OK) {
      // Use larger buffer to ensure no truncation
      char part_buf[256];
      size_t hlen = snprintf((char *)part_buf, 256, _STREAM_PART, _jpg_buf_len,
                             (int)_timestamp.tv_sec, (int)_timestamp.tv_usec,
                             current_rssi);
      res = httpd_resp_send_chunk(req, (const char *)part_buf, hlen);
    }
    if (res == ESP_OK)
      res = httpd_resp_send_chunk(req, (const char *)_jpg_buf, _jpg_buf_len);
    if (send_attempted)
      send_ms = (uint32_t)((esp_timer_get_time() - send_start) / 1000);

    if (fb) {
      esp_camera_fb_return(fb);
      fb = NULL;
      _jpg_buf = NULL;
    } else if (_jpg_buf) {
      free(_jpg_buf);
      _jpg_buf = NULL;
    }

    if (res != ESP_OK) {
      if (send_attempted)
        send_fail_count++;
      break;
    }

    // --- FPS BERECHNUNG & AUSGABE ---
    int64_t fr_end = esp_timer_get_time();
    int64_t frame_time = (fr_end - last_frame) / 1000;
    last_frame = fr_end;

    uint32_t avg_frame_time = ra_filter_run(&ra_filter, frame_time);

    // Serielle Ausgabe pro Frame bremst lange Streams stark aus.
    if ((fr_end - last_log) >= 1000000) {
      uint32_t free_heap = ESP.getFreeHeap();
      uint32_t free_psram =
          (uint32_t)heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
      last_log = fr_end;
      remoteLogf(
          "STAT t=%lu size=%uB frame=%ums avg=%ums fb=%ums send=%ums fps=%.1f "
          "rssi=%d heap=%u psram=%u disc=%lu gotip=%lu fb_fail=%lu send_fail=%lu\n",
          millis(), (uint32_t)_jpg_buf_len, (uint32_t)frame_time,
          avg_frame_time, fb_get_ms, send_ms,
          avg_frame_time > 0 ? (1000.0f / avg_frame_time) : 0.0f, current_rssi,
          free_heap, free_psram, (unsigned long)wifiDisconnectCount,
          (unsigned long)wifiGotIpCount, (unsigned long)fb_fail_count,
          (unsigned long)send_fail_count);
    }

    if (frame_time > 500 || fb_get_ms > 250 || send_ms > 250) {
      remoteLogf(
          "SPIKE t=%lu size=%uB frame=%ums fb=%ums send=%ums rssi=%d heap=%u "
          "psram=%u\n",
          millis(), (uint32_t)_jpg_buf_len, (uint32_t)frame_time, fb_get_ms,
          send_ms, current_rssi, ESP.getFreeHeap(),
          (uint32_t)heap_caps_get_free_size(MALLOC_CAP_SPIRAM));
    }

    vTaskDelay(pdMS_TO_TICKS(120));
  }

#if defined(LED_GPIO_NUM)
  isStreaming = false;
  enable_led(false);
#endif
  last_frame = 0;
  last_log = 0;
  streamClientActive = false;
  return res;
}

// CMD, STATUS, REG & INDEX Handler bleiben weitgehend gleich...
static esp_err_t parse_get(httpd_req_t *req, char **obuf) {
  char *buf = NULL;
  size_t buf_len = httpd_req_get_url_query_len(req) + 1;
  if (buf_len > 1) {
    buf = (char *)malloc(buf_len);
    if (!buf) {
      httpd_resp_send_500(req);
      return ESP_FAIL;
    }
    if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
      *obuf = buf;
      return ESP_OK;
    }
    free(buf);
  }
  httpd_resp_send_404(req);
  return ESP_FAIL;
}

static esp_err_t cmd_handler(httpd_req_t *req) {
  char *buf = NULL;
  char variable[32];
  char value[32];
  if (parse_get(req, &buf) != ESP_OK)
    return ESP_FAIL;
  if (httpd_query_key_value(buf, "var", variable, sizeof(variable)) != ESP_OK ||
      httpd_query_key_value(buf, "val", value, sizeof(value)) != ESP_OK) {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);
  int val = atoi(value);
  sensor_t *s = esp_camera_sensor_get();
  if (!s) {
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, NULL, 0);
  }
  int res = 0;

  if (!strcmp(variable, "framesize")) {
    if (s->pixformat == PIXFORMAT_JPEG)
      res = s->set_framesize(s, (framesize_t)val);
  } else if (!strcmp(variable, "quality"))
    res = s->set_quality(s, val);
  else if (!strcmp(variable, "contrast"))
    res = s->set_contrast(s, val);
  else if (!strcmp(variable, "brightness"))
    res = s->set_brightness(s, val);
  else if (!strcmp(variable, "saturation"))
    res = s->set_saturation(s, val);
  else if (!strcmp(variable, "awb"))
    res = s->set_whitebal(s, val);
  else if (!strcmp(variable, "agc"))
    res = s->set_gain_ctrl(s, val);
  else if (!strcmp(variable, "aec"))
    res = s->set_exposure_ctrl(s, val);
  else if (!strcmp(variable, "hmirror"))
    res = s->set_hmirror(s, val);
  else if (!strcmp(variable, "vflip"))
    res = s->set_vflip(s, val);
#if defined(LED_GPIO_NUM)
  else if (!strcmp(variable, "led_intensity")) {
    led_duty = val;
    if (isStreaming)
      enable_led(true);
  }
#endif
  else
    res = -1;

