thunle/CameraWebServer_ESP32S3_OV3660/.arduino-build-sensor-test/sketch/app_httpd.cpp
  if (res < 0)
    return httpd_resp_send_500(req);
  set_close_headers(req);
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t status_handler(httpd_req_t *req) {
  static char json_response[1024];
  sensor_t *s = esp_camera_sensor_get();
  String wifiSsid = WiFi.SSID();
  String localIp = WiFi.localIP().toString();
  String gatewayIp = WiFi.gatewayIP().toString();
  char *p = json_response;
  *p++ = '{';
  p += sprintf(p, "\"wifi_connected\":%u,", WiFi.status() == WL_CONNECTED ? 1 : 0);
  p += sprintf(p, "\"wifi_ssid\":\"%s\",", wifiSsid.c_str());
  p += sprintf(p, "\"wifi_ip\":\"%s\",", localIp.c_str());
  p += sprintf(p, "\"wifi_gateway\":\"%s\",", gatewayIp.c_str());
  p += sprintf(p, "\"wifi_rssi\":%d,", WiFi.RSSI());
  p += sprintf(p, "\"camera_ready\":%s,", s ? "true" : "false");
  if (!s) {
    p += sprintf(p, "\"xclk\":0,");
    p += sprintf(p, "\"pixformat\":0,");
    p += sprintf(p, "\"framesize\":0,");
    p += sprintf(p, "\"quality\":0,");
    p += sprintf(p, "\"brightness\":0,");
    p += sprintf(p, "\"contrast\":0,");
    p += sprintf(p, "\"saturation\":0,");
    p += sprintf(p, "\"hmirror\":0,");
    p += sprintf(p, "\"vflip\":0");
#if defined(LED_GPIO_NUM)
    p += sprintf(p, ",\"led_intensity\":%u", led_duty);
#endif
    *p++ = '}';
    *p++ = 0;
    httpd_resp_set_type(req, "application/json");
    set_close_headers(req);
    return httpd_resp_send(req, json_response, strlen(json_response));
  }
  p += sprintf(p, "\"xclk\":%u,", s->xclk_freq_hz / 1000000);
  p += sprintf(p, "\"pixformat\":%u,", s->pixformat);
  p += sprintf(p, "\"framesize\":%u,", s->status.framesize);
  p += sprintf(p, "\"quality\":%u,", s->status.quality);
  p += sprintf(p, "\"brightness\":%d,", s->status.brightness);
  p += sprintf(p, "\"contrast\":%d,", s->status.contrast);
  p += sprintf(p, "\"saturation\":%d,", s->status.saturation);
  p += sprintf(p, "\"hmirror\":%u,", s->status.hmirror);
  p += sprintf(p, "\"vflip\":%u", s->status.vflip);
#if defined(LED_GPIO_NUM)
  p += sprintf(p, ",\"led_intensity\":%u", led_duty);
#endif
  *p++ = '}';
  *p++ = 0;
  httpd_resp_set_type(req, "application/json");
    set_close_headers(req);
  return httpd_resp_send(req, json_response, strlen(json_response));
}

static esp_err_t sensors_handler(httpd_req_t *req) {
  uint32_t now = millis();

#if !(RADAR_PIN_TEST || LIGHT_SENSOR_PIN_TEST || RADAR_UART_TEST || BUZZER_PIN_TEST)
  char response[640];
  int response_len = snprintf(
      response, sizeof(response),
      "{\"radar_active\":false,\"daylight\":false,\"light_raw\":0,"
      "\"light_day_threshold\":%d,\"radar_motion_count\":0,"
      "\"dark_alarm_count\":0,\"local_radar_buzzer_count\":0,"
      "\"last_motion_ms\":0,\"sensor_age_ms\":0,"
      "\"buzzer_active\":false,\"buzzer_alarm_enabled\":false,"
      "\"local_radar_buzzer_enabled\":false,\"uptime_ms\":%lu,"
      "\"radar_uart_baud\":0,\"radar_uart_bytes\":0,"
      "\"radar_uart_frames\":0,\"radar_energy_frames\":0,"
      "\"radar_energy_present\":false,\"radar_energy_distance_cm\":0,"
      "\"radar_gate_energy\":[],\"radar_uart_present\":false,"
      "\"radar_uart_range\":-1,\"radar_uart_last_rx_ms\":0,"
      "\"radar_uart_age_ms\":0,\"radar_uart_last_text\":\"\","
      "\"radar_uart_last_hex\":\"\"}",
      LIGHT_DAY_THRESHOLD, (unsigned long)now);
  if (response_len < 0) {
    return httpd_resp_send_500(req);
  }
  if ((size_t)response_len >= sizeof(response)) {
    response_len = sizeof(response) - 1;
  }
  httpd_resp_set_type(req, "application/json");
  set_close_headers(req);
  httpd_resp_set_hdr(req, "Cache-Control", "no-store");
  return httpd_resp_send(req, response, response_len);
#else
  uint32_t last_read = sensorLastReadMs;
  uint32_t last_motion = radarLastMotionMs;
  uint32_t radar_uart_last_rx = radarUartLastRxMs;
  uint32_t buzzer_until = buzzerPulseUntilMs;
  String radar_uart_hex = getRadarUartLastHexSnapshot();
  String radar_uart_text = getRadarUartLastTextSnapshot();
  uint16_t gate_energy[16];
  getRadarGateEnergySnapshot(gate_energy, 16);

  char gate_json[160];
  char *g = gate_json;
  size_t remaining = sizeof(gate_json);
  int written = snprintf(g, remaining, "[");
  g += written;
  remaining -= written;
  for (size_t i = 0; i < 16 && remaining > 1; i++) {
    written = snprintf(g, remaining, "%s%u", i == 0 ? "" : ",",
                       (unsigned int)gate_energy[i]);
    if (written < 0 || (size_t)written >= remaining) {
      break;
    }
    g += written;
    remaining -= written;
  }
  snprintf(g, remaining, "]");

  char response[1536];
  int response_len = snprintf(
      response, sizeof(response),
      "{\"radar_active\":%s,\"daylight\":%s,\"light_raw\":%d,"
      "\"light_day_threshold\":%d,\"radar_motion_count\":%lu,"
      "\"dark_alarm_count\":%lu,\"local_radar_buzzer_count\":%lu,"
      "\"last_motion_ms\":%lu,"
      "\"sensor_age_ms\":%lu,\"buzzer_active\":%s,"
      "\"buzzer_alarm_enabled\":%s,\"local_radar_buzzer_enabled\":%s,"
      "\"uptime_ms\":%lu,"
      "\"radar_uart_baud\":%lu,\"radar_uart_bytes\":%lu,\"radar_uart_frames\":%lu,"
      "\"radar_energy_frames\":%lu,\"radar_energy_present\":%s,"
      "\"radar_energy_distance_cm\":%u,\"radar_gate_energy\":%s,"
      "\"radar_uart_present\":%s,\"radar_uart_range\":%d,"
      "\"radar_uart_last_rx_ms\":%lu,\"radar_uart_age_ms\":%lu,"
      "\"radar_uart_last_text\":\"%s\",\"radar_uart_last_hex\":\"%s\"}",
      radarActive ? "true" : "false", daylightActive ? "true" : "false",
      lightRaw, LIGHT_DAY_THRESHOLD, (unsigned long)radarMotionCount,
      (unsigned long)darkAlarmCount, (unsigned long)localRadarBuzzerCount,
      (unsigned long)last_motion,
      (unsigned long)(now - last_read),
      (buzzer_until != 0 && (int32_t)(now - buzzer_until) < 0) ? "true"
                                                               : "false",
      buzzerAlarmEnabled ? "true" : "false",
      localRadarBuzzerEnabled ? "true" : "false",
      (unsigned long)now, (unsigned long)radarUartCurrentBaud,
      (unsigned long)radarUartByteCount,
      (unsigned long)radarUartFrameCount,
      (unsigned long)radarEnergyFrameCount,
      radarEnergyPresent ? "true" : "false",
      (unsigned int)radarEnergyDistanceCm,
      gate_json,
      radarUartPresent ? "true" : "false", radarUartRange,
      (unsigned long)radar_uart_last_rx,
      radar_uart_last_rx == 0 ? 0 : (unsigned long)(now - radar_uart_last_rx),
      radar_uart_text.c_str(),
      radar_uart_hex.c_str());
  if (response_len < 0) {
    return httpd_resp_send_500(req);
  }
  if ((size_t)response_len >= sizeof(response)) {
    response_len = sizeof(response) - 1;
  }

  httpd_resp_set_type(req, "application/json");
  set_close_headers(req);
  httpd_resp_set_hdr(req, "Cache-Control", "no-store");
  return httpd_resp_send(req, response, response_len);
#endif
}

static esp_err_t xclk_handler(httpd_req_t *req) {
  char *buf = NULL;
  char xclk_value[32];

