thunle/CameraWebServer_ESP32S3_OV3660/.arduino-build-sensor-test/sketch/app_httpd.cpp
  if (parse_get(req, &buf) != ESP_OK)
    return ESP_FAIL;
  if (httpd_query_key_value(buf, "xclk", xclk_value, sizeof(xclk_value)) !=
      ESP_OK) {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

  sensor_t *s = esp_camera_sensor_get();
  int xclk = atoi(xclk_value);
  int res = s->set_xclk(s, LEDC_TIMER_0, xclk);

  if (res < 0)
    return httpd_resp_send_500(req);
  set_close_headers(req);
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t index_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
  sensor_t *s = esp_camera_sensor_get();
  if (s && s->id.PID == OV3660_PID)
    return httpd_resp_send(req, (const char *)index_ov3660_html_gz,
                           index_ov3660_html_gz_len);
  return httpd_resp_send(req, (const char *)index_ov2640_html_gz,
                         index_ov2640_html_gz_len);
}

static esp_err_t logs_handler(httpd_req_t *req) {
  char *buf = NULL;
  bool clear_after_read = false;
  size_t buf_len = httpd_req_get_url_query_len(req) + 1;

  if (buf_len > 1) {
    buf = (char *)malloc(buf_len);
    if (!buf) {
      httpd_resp_send_500(req);
      return ESP_FAIL;
    }
    if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
      char clear_value[8];
      if (httpd_query_key_value(buf, "clear", clear_value,
                                sizeof(clear_value)) == ESP_OK) {
        clear_after_read = strcmp(clear_value, "1") == 0;
      }
    }
    free(buf);
  }

  String snapshot = getRemoteLogSnapshot(clear_after_read);
  if (snapshot.isEmpty()) {
    snapshot = "No logs yet.\n";
  }

  httpd_resp_set_type(req, "text/plain; charset=utf-8");
  set_close_headers(req);
  httpd_resp_set_hdr(req, "Cache-Control", "no-store");
  return httpd_resp_send(req, snapshot.c_str(), snapshot.length());
}

static esp_err_t buzzer_handler(httpd_req_t *req) {
  char *buf = NULL;
  size_t buf_len = httpd_req_get_url_query_len(req) + 1;
  char state[16] = "off";
  char duration_param[16] = "0";
  char alarm_enabled_param[16] = "";
  char radar_buzzer_param[16] = "";
  char force_param[8] = "0";
  uint32_t duration_ms = 0;
  bool has_alarm_enabled = false;
  bool has_radar_buzzer = false;

  if (buf_len > 1) {
    buf = (char *)malloc(buf_len);
    if (!buf) {
      httpd_resp_send_500(req);
      return ESP_FAIL;
    }
    if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
      httpd_query_key_value(buf, "state", state, sizeof(state));
      httpd_query_key_value(buf, "duration_ms", duration_param,
                            sizeof(duration_param));
      has_alarm_enabled =
          httpd_query_key_value(buf, "alarm_enabled", alarm_enabled_param,
                                sizeof(alarm_enabled_param)) == ESP_OK;
      has_radar_buzzer =
          httpd_query_key_value(buf, "radar_buzzer", radar_buzzer_param,
                                sizeof(radar_buzzer_param)) == ESP_OK;
      httpd_query_key_value(buf, "force", force_param, sizeof(force_param));
    }
    free(buf);
  }

  duration_ms = (uint32_t)atoi(duration_param);

  if (has_radar_buzzer) {
    localRadarBuzzerEnabled = strcmp(radar_buzzer_param, "1") == 0 ||
                              strcmp(radar_buzzer_param, "true") == 0 ||
                              strcmp(radar_buzzer_param, "on") == 0;
    settingsPrefs.putBool("radar_buzzer", localRadarBuzzerEnabled);
    remoteLogf("[ALARM] local radar buzzer enabled=%u\n",
               localRadarBuzzerEnabled ? 1 : 0);
  }

  if (has_alarm_enabled) {
    buzzerAlarmEnabled = strcmp(alarm_enabled_param, "1") == 0 ||
                         strcmp(alarm_enabled_param, "true") == 0 ||
                         strcmp(alarm_enabled_param, "on") == 0;
    if (!buzzerAlarmEnabled) {
      digitalWrite(BUZZER_PIN, BUZZER_OFF_LEVEL);
      buzzerPulseUntilMs = 0;
    }
    remoteLogf("Buzzer alarm_enabled=%u\n", buzzerAlarmEnabled ? 1 : 0);
  } else if (strcmp(state, "on") == 0) {
    bool forced = strcmp(force_param, "1") == 0 ||
                  strcmp(force_param, "true") == 0 ||
                  strcmp(force_param, "on") == 0;
    if (duration_ms > 0 && !buzzerAlarmEnabled && !forced) {
      digitalWrite(BUZZER_PIN, BUZZER_OFF_LEVEL);
      buzzerPulseUntilMs = 0;
      remoteLogf("Buzzer alarm pulse suppressed duration_ms=%lu\n",
                 (unsigned long)duration_ms);
    } else {
    digitalWrite(BUZZER_PIN, BUZZER_ON_LEVEL);
    buzzerPulseUntilMs = duration_ms > 0 ? millis() + duration_ms : 0;
    remoteLogf("Buzzer ON duration_ms=%lu\n", (unsigned long)duration_ms);
    }
  } else {
    digitalWrite(BUZZER_PIN, BUZZER_OFF_LEVEL);
    buzzerPulseUntilMs = 0;
    remoteLogln("Buzzer OFF");
  }

  char response[160];
  int response_len = snprintf(response, sizeof(response),
                              "{\"state\":\"%s\",\"duration_ms\":%lu,"
                              "\"alarm_enabled\":%s,"
                              "\"local_radar_buzzer_enabled\":%s}",
                              strcmp(state, "on") == 0 ? "on" : "off",
                              (unsigned long)duration_ms,
                              buzzerAlarmEnabled ? "true" : "false",
                              localRadarBuzzerEnabled ? "true" : "false");

  httpd_resp_set_type(req, "application/json");
  set_close_headers(req);
  return httpd_resp_send(req, response, response_len);
}

void startCameraServer() {
  httpd_config_t config = HTTPD_DEFAULT_CONFIG();
  config.send_wait_timeout = 1;
  config.recv_wait_timeout = 1;
  config.lru_purge_enable = true;
  config.max_open_sockets = 7;
  config.backlog_conn = 2;
  config.max_uri_handlers = 18;

  httpd_uri_t index_uri = {.uri = "/",
                           .method = HTTP_GET,
                           .handler = index_handler,
                           .user_ctx = NULL};
  httpd_uri_t status_uri = {.uri = "/status",
                            .method = HTTP_GET,
                            .handler = status_handler,
                            .user_ctx = NULL};
  httpd_uri_t xclk_uri = {.uri = "/xclk",
                          .method = HTTP_GET,
                          .handler = xclk_handler,
                          .user_ctx = NULL};
  httpd_uri_t cmd_uri = {.uri = "/control",
                         .method = HTTP_GET,
                         .handler = cmd_handler,
                         .user_ctx = NULL};
  httpd_uri_t capture_uri = {.uri = "/capture",
                             .method = HTTP_GET,
                             .handler = capture_handler,
                             .user_ctx = NULL};
  httpd_uri_t logs_uri = {.uri = "/logs",
                          .method = HTTP_GET,
                          .handler = logs_handler,
                          .user_ctx = NULL};
  httpd_uri_t sensors_uri = {.uri = "/sensors",
                             .method = HTTP_GET,
                             .handler = sensors_handler,
                             .user_ctx = NULL};
  httpd_uri_t stream_uri = {.uri = "/stream",
                            .method = HTTP_GET,
                            .handler = stream_handler,
                            .user_ctx = NULL};
  httpd_uri_t buzzer_uri = {.uri = "/buzzer",
                            .method = HTTP_GET,
                            .handler = buzzer_handler,
                            .user_ctx = NULL};

  ra_filter_init(&ra_filter, 20);

  if (httpd_start(&camera_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(camera_httpd, &index_uri);
    httpd_register_uri_handler(camera_httpd, &cmd_uri);
    httpd_register_uri_handler(camera_httpd, &status_uri);
    httpd_register_uri_handler(camera_httpd, &xclk_uri);
    httpd_register_uri_handler(camera_httpd, &capture_uri);
    httpd_register_uri_handler(camera_httpd, &logs_uri);
    httpd_register_uri_handler(camera_httpd, &sensors_uri);
    httpd_register_uri_handler(camera_httpd, &buzzer_uri);
  }

#if !CAMERA_DISABLED_TEST
  config.server_port += 1;
  config.ctrl_port += 1;
  if (httpd_start(&stream_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(stream_httpd, &stream_uri);
  }
#else
  remoteLogln("[CAMERA-TEST] stream server disabled with camera disabled");
#endif
}

void setupLedFlash() {
#if defined(LED_GPIO_NUM)
  ledcAttach(LED_GPIO_NUM, 5000, 8);
#endif
}
